package com.kir138.lesson3StreamAPI.trainingSkills;

import java.util.Arrays;
import java.util.List;
import java.util.stream.Collectors;

public class Training {
    public static void main(String[] args) {

    /**
     * Задача 1.
     *     Используйте лямбда-выражения для фильтрации списка строк, оставив только те
     *     строки, длина которых превышает 3 символа.
     */
    /*List<String> strings = Arrays.asList("cat", "elephant", "dog", "hippopotamus");
    List<String> result = strings.stream().
        filter(s -> s.length() >= 4).toList();
        System.out.println(result);*/

        /**
         * Задача 2.
         *      Используйте лямбда-выражения для преобразования каждого элемента
         *      списка целых чисел в его квадрат.
         */
        /*List<Integer> numbers = Arrays.asList(1, 2, 3, 4, 5);
        List<Integer> result = numbers.stream().
            map(s -> s * s).toList();
        System.out.println(result);*/

        /**
         * Задача 3.
         *      Фильтрация списка объектов класса `Student`,
         *      оставляя только тех студентов, чей средний балл выше 8.0.
         */


    }
}
